gene96817/R4A_ESP32/examples/Freenove_4WD_Car/R4A_Robot.h
extern const R4A_MENU_ENTRY r4aNtripClientMenuTable[];
#define R4A_NTRIP_CLIENT_MENU_ENTRIES   5   // NTRIP client menu table entries

//****************************************
// ReadLine API
//****************************************

// Read a line of input from a Bluetooth serial port into a character array
// Inputs:
//   echo: Specify true to enable echo of input characters and false otherwise
//   buffer: Address of a string that contains the input line
//   port: Address of a Bluetooth serial port structure
// Outputs:
//   nullptr when the line is not complete
String * r4aReadLine(bool echo, String * buffer, BluetoothSerial * port);

// Read a line of input from a serial port into a character array
// Inputs:
//   echo: Specify true to enable echo of input characters and false otherwise
//   buffer: Address of a string that contains the input line
//   port: Address of a HardwareSerial port structure
// Outputs:
//   nullptr when the line is not complete
String * r4aReadLine(bool echo, String * buffer, HardwareSerial * port = &Serial);

// Read a line of input from a WiFi client into a character array
// Inputs:
//   echo: Specify true to enable echo of input characters and false otherwise
//   buffer: Address of a string that contains the input line
//   port: Address of a NetworkClient port structure
// Outputs:
//   nullptr when the line is not complete
String * r4aReadLine(bool echo, String * buffer, NetworkClient * port);

//****************************************
// Robot Challenge API
//****************************************

// The robotRunning routine calls this routine to actually perform
// the challenge.  This routine typically reads a sensor and may
// optionally adjust the motors based upon the sensor reading.  The
// routine then must return.  The robot layer will call this routine
// multiple times during the robot operation.
// Inputs:
//   object: Address of a R4A_ROBOT_CHALLENGE data structure
typedef void (* R4A_ROBOT_CHALLENGE_ROUTINE)(struct _R4A_ROBOT_CHALLENGE * object);

// Initialize the robot challenge
// The robotStart calls this routine before switching to the initial
// delay state.
// Inputs:
//   object: Address of a R4A_ROBOT_CHALLENGE data structure
typedef void (* R4A_ROBOT_CHALLENGE_INIT)(struct _R4A_ROBOT_CHALLENGE * object);

// Start the robot challenge
// The initial delay routine calls this routine just before calling
// the challenge routine for the first time.
// Inputs:
//   object: Address of a R4A_ROBOT_CHALLENGE data structure
typedef void (* R4A_ROBOT_CHALLENGE_START)(struct _R4A_ROBOT_CHALLENGE * object);

// The robotStop routine calls this routine to stop the motors and
// perform any other actions.
// Inputs:
//   object: Address of a R4A_ROBOT_CHALLENGE data structure
typedef void (* R4A_ROBOT_CHALLENGE_STOP)(struct _R4A_ROBOT_CHALLENGE * object);

typedef struct _R4A_ROBOT_CHALLENGE
{
    // Constants, DO NOT MODIFY, set during structure initialization
    R4A_ROBOT_CHALLENGE_ROUTINE _challenge;
    R4A_ROBOT_CHALLENGE_INIT _init;
    R4A_ROBOT_CHALLENGE_START _start;
    R4A_ROBOT_CHALLENGE_STOP _stop;

    const char * _name; // Name of the challenge
    uint32_t _duration; // Number of seconds to run the robot challenge
} R4A_ROBOT_CHALLENGE;

//****************************************
// Robot API
//****************************************

enum ROBOT_STATES
{
    ROBOT_STATE_IDLE = 0,   // The robot layer is idle
    ROBOT_STATE_COUNT_DOWN, // The robot layer is counting down to start
    ROBOT_STATE_RUNNING,    // The robot layer is running the challenge
    ROBOT_STATE_STOP,       // The robot layer is stopped
};

// Display the delta time
// Inputs:
//   deltaMsec: Milliseconds to display
typedef void (* R4A_ROBOT_TIME_CALLBACK)(uint32_t deltaMsec);

typedef struct _R4A_ROBOT
{
    // Private

    volatile bool _busy;    // True while challenge is running
    volatile R4A_ROBOT_CHALLENGE * _challenge;  // Address of challenge object
    int _core;              // CPU core number
    uint32_t _afterRunMsec; // Delay after robot's run and switching to idle
    uint32_t _endMsec;      // Challenge end time in milliseconds since boot
    uint32_t _idleMsec;     // Last idle time in milliseconds since boot
    uint32_t _initMsec;     // Challenge init time in milliseconds since boot
    uint32_t _nextDisplayMsec; // Next time display time should be called in milliseconds since boot
    uint32_t _startDelayMsec;  // Number of milliseconds before starting the challenge
    uint32_t _startMsec;    // Challenge start time in milliseconds since boot
    uint32_t _stopMsec;     // Challenge stop time in milliseconds since boot
    uint8_t _state;         // Next state for robot operation

    // Called by the init routine to display the countdown time
    // Called by the initial delay routine to display the countdown time
    // Called by the stop routine to display the actual challenge duration
    // Inputs:
    //   mSecToStart: Milliseconds until the robot is to start the
    //                challenge
    R4A_ROBOT_TIME_CALLBACK _displayTime;   // May be set to nullptr

    // Called by the update routine when the robot is not running a challenge
    // Inputs:
    //   mSecToStart: Milliseconds until the robot is to start the
    //                challenge
    R4A_ROBOT_TIME_CALLBACK _idle;  // Maybe set to nullptr
} R4A_ROBOT;

// Initialize the robot data structure
// Inputs:
//   robot: Address of an R4A_ROBOT data structure
//   core: CPU core that is running the robot layer
//   startDelaySec: Number of seconds before the robot starts a challenge
//   afterRunSec: Number of seconds after the robot completes a challenge
//                before the robot layer switches back to the idle state
//   idle: Address of the idle routine, may be nullptr
//   displayTime: Address of the routine to display the time, may be nullptr
void r4aRobotInit(R4A_ROBOT * robot,
                  int core = 0,
                  uint32_t startDelaySec = 10,
                  uint32_t afterRunSec = 30,
                  R4A_ROBOT_TIME_CALLBACK idle = nullptr,
                  R4A_ROBOT_TIME_CALLBACK displayTime = nullptr);

