gene96817/R4A_ESP32/examples/Freenove_4WD_Car/R4A_Robot.h
// Determine if it is possible to start the robot
// Inputs:
//   robot: Address of an R4A_ROBOT data structure
//   challenge: Address of challenge object
//   duration: Number of seconds to run the challenge
//   display: Device used for output
bool r4aRobotStart(R4A_ROBOT * robot,
                   R4A_ROBOT_CHALLENGE * challenge,
                   uint32_t duration,
                   Print * display = &Serial);

// Determine if the robot layer is active
// Inputs:
//   robot: Address of an R4A_ROBOT data structure
// Outputs:
//   Returns true when the challenge is running and false otherwise
bool r4aRobotIsActive(R4A_ROBOT * robot);

// Stop the robot
// Inputs:
//   robot: Address of an R4A_ROBOT data structure
//   currentMsec: Milliseconds since boot
//   display: Device used for output
void r4aRobotStop(R4A_ROBOT * robot,
                  uint32_t currentMsec,
                  Print * display = &Serial);

// Update the robot state
// Inputs:
//   robot: Address of an R4A_ROBOT data structure
//   currentMsec: Milliseconds since boot
void r4aRobotUpdate(R4A_ROBOT * robot,
                    uint32_t currentMsec);

//****************************************
// Serial API
//****************************************

// Repeatedly display a fatal error message
// Inputs:
//   errorMessage: Zero terminated string of characters containing the
//                 error mesage to be displayed
//   display: Device used for output
void r4aReportFatalError(const char * errorMessage,
                         Print * display = &Serial);

// Process Bluetooth menu item
// Inputs:
//   menu: Address of the menu object
//   port: Address of a BluetoothSerial object
// Outputs:
//   Returns true when the client exits the menu system and false otherwise
bool r4aBluetoothMenu(R4A_MENU * menu, BluetoothSerial * port);

// Process serial menu item
// Inputs:
//   menu: Address of the menu object
void r4aSerialMenu(R4A_MENU * menu);

//****************************************
// SPI API
//****************************************

// Allocate DMA buffer
// Inputs:
//   length: Number of data bytes to allocate
// Outputs:
//   Returns the buffer address if successful and nullptr otherwise
typedef uint8_t * (* R4A_SPI_ALLOCATE_DMA_BUFFER)(int length);

// Transfer data to the SPI device
// Inputs:
//   spi: Address of an R4A_SPI data structure
//   txBuffer: Address of the buffer containing the data to send
//   rxBuffer: Address of the receive data buffer
//   length: Number of data bytes to transfer
typedef void (* R4A_SPI_TRANSFER)(struct _R4A_SPI * spi,
                                  const uint8_t * txBuffer,
                                  uint8_t * rxBuffer,
                                  uint32_t length);

typedef struct _R4A_SPI
{
    R4A_SPI_ALLOCATE_DMA_BUFFER allocateDmaBuffer;
    R4A_SPI_TRANSFER transfer;
} R4A_SPI;

extern R4A_SPI * r4aSpi;

//****************************************
// Stricmp API
//****************************************

// Compare two strings ignoring case
// Inputs:
//   str1: Address of a zero terminated string of characters
//   str2: Address of a zero terminated string of characters
// Outputs:
//   Returns the delta value of the last comparison (str1[x] - str2[x])
int r4aStricmp(const char *str1, const char *str2);

//****************************************
// Strincmp API
//****************************************

// Compare two strings limited to N characters ignoring case
// Inputs:
//   str1: Address of a zero terminated string of characters
//   str2: Address of a zero terminated string of characters
//   length: Maximum number of characters to compare
// Outputs:
//   Returns the delta value of the last comparison (str1[x] - str2[x])
int r4aStrincmp(const char *str1, const char *str2, int length);

//****************************************
// Support API
//****************************************

// Get the parameter
// Inputs:
//   parameter: Address of address of a zero terminated string of characters
// Outputs:
//   Returns the address of the next parameter
uint8_t * r4aSupportGetParameter(uint8_t ** parameter);

// Remove white space before a parameter
// Inputs:
//   parameter: Address of a zero terminated string of characters containing
//              leading white space and a parameter
// Outputs:
//   Returns the address of the parameter
uint8_t * r4aSupportRemoveWhiteSpace(uint8_t * parameter);

// Trim white space at the end of the parameter
// Inputs:
//   parameter: Address of a zero terminated string of characters containing
//              leading white space and a parameter
// Outputs:
//   Returns the address of the parameter
void r4aSupportTrimWhiteSpace(uint8_t * parameter);

//****************************************
// Telnet Client API
//****************************************

// Finish creating the network client
// Inputs:
//   parameter: Buffer to receive the address of an object allocated by
//              this routine
//   client: Address of a NetworkClient object
// Outputs:
//   Returns true if the routine was successful and false upon failure.
typedef bool (* R4A_TELNET_CONTEXT_CREATE)(void ** parameter,
                                           NetworkClient * client);

// Clean up after the parameter object returned by r4aTelnetClientBegin
// Inputs:
//   parameter: Buffer containing the address of a data structure allocated
//              by R4A_TELNET_CONTEXT_CREATE
typedef void (* R4A_TELNET_CONTEXT_DELETE)(void ** parameter);

// Process input characters from the telnet client
// Inputs:
//   parameter: Address of object allocated by R4A_TELNET_CONTEXT_CREATE
//   client: Address of a NetworkClient object
// Outputs:
//   Returns true if the client is done (requests exit)
typedef bool (* R4A_TELNET_CLIENT_PROCESS_INPUT)(void * parameter,
                                                 NetworkClient * client);

// Telnet client
class R4A_TELNET_CLIENT
{
  private:

    NetworkClient _client;
    String _command;
    R4A_TELNET_CONTEXT_CREATE _contextCreate;
    void * _contextData;
    R4A_TELNET_CONTEXT_DELETE _contextDelete;
    R4A_TELNET_CLIENT_PROCESS_INPUT _processInput;

