gene96817/R4A_ESP32/examples/Freenove_4WD_Car/R4A_Robot.h
  public:

    // Constructor: Initialize the telnet client object
    // Inputs:
    //   client: Address of a NetworkClient object
    //   processInput: Address of a function to process input characters
    //   contextCreate: Address of a function to create the telnet context
    //   contextDelete: Address of a function to delete the telnet context
    R4A_TELNET_CLIENT(NetworkClient client,
                      R4A_TELNET_CLIENT_PROCESS_INPUT processInput,
                      R4A_TELNET_CONTEXT_CREATE contextCreate = nullptr,
                      R4A_TELNET_CONTEXT_DELETE contextDelete = nullptr);

    // Destructor: Cleanup the things allocated in the constructor
    ~R4A_TELNET_CLIENT();

    // Break the client connection
    void disconnect();

    // Determine if the client is connected
    // Outputs:
    //   Returns true if the client is connected
    bool isConnected();

    // Process the incoming telnet client data
    // Outputs:
    //   Returns true when the client wants to exit, false to continue
    //   processing input.
    bool processInput();

    // Get the IP address
    // Outputs:
    //   Returns the IP address of the remote telnet client.
    IPAddress remoteIP();

    // Get the port number
    // Outputs:
    //   Returns the port number used by the remote telnet client.
    uint16_t remotePort();

    // Write to all clients
    // Inputs:
    //   data: Data byte to write to the clients
    // Outputs:
    //   Returns the number of bytes written
    size_t write(uint8_t data);

    // Write to all clients
    // Inputs:
    //   data: Address of the data to write to the clients
    //   length: Number of data bytes to write
    // Outputs:
    //   Returns the number of bytes written
    size_t write(const uint8_t * data, size_t length);
};

//*********************************************************************
// Data associated with the telnet connection
typedef struct _R4A_TELNET_CONTEXT
{
    // Public
    String _command; // User command received via telnet
    bool _displayOptions;
    bool _echo;
    R4A_MENU _menu;  // Strcture describing the menu system
} R4A_TELNET_CONTEXT;

// Initialize the R4A_TELNET_CONTEXT data structure
// Inputs:
//   context: Address of an R4A_TELNET_CONTEXT data structure
//   menuTable: Address of table containing the menu descriptions, the
//              main menu must be the first entry in the table.
//   menuEntries: Number of entries in the menu table
//   blankLineBeforePreMenu: Display a blank line before the preMenu
//   blankLineBeforeMenuHeader: Display a blank line before the menu header
//   blankLineAfterMenuHeader: Display a blank line after the menu header
//   alignCommands: Align the commands
//   blankLineAfterMenu: Display a blank line after the menu
void r4aTelnetContextBegin(R4A_TELNET_CONTEXT * context,
                           int menuTableEntries,
                           bool displayOptions = false,
                           bool echo = false,
                           bool blankLineBeforePreMenu = true,
                           bool blankLineBeforeMenuHeader = true,
                           bool blankLineAfterMenuHeader = false,
                           bool alignCommands = true,
                           bool blankLineAfterMenu = false);

// Finish creating the network client
// Inputs:
//   contextAddr: Buffer to receive the address of an R4A_TELNET_CONTEXT
//                data structure allocated by this routine
//   client: Address of a NetworkClient object
//   menuTable: Address of table containing the menu descriptions, the
//              main menu must be the first entry in the table.
//   menuEntries: Number of entries in the menu table
//   displayOptions: Display the telnet header options
//   echo: Echo the input characters
//   blankLineBeforePreMenu: Display a blank line before the preMenu
//   blankLineBeforeMenuHeader: Display a blank line before the menu header
//   blankLineAfterMenuHeader: Display a blank line after the menu header
//   alignCommands: Align the commands
//   blankLineAfterMenu: Display a blank line after the menu
// Outputs:
//   Returns true if the routine was successful and false upon failure.
bool r4aTelnetContextCreate(void ** contextAddr,
                            NetworkClient * client,
                            const R4A_MENU_TABLE * menuTable,
                            int menuTableEntries,
                            bool displayOptions = false,
                            bool echo = false,
                            bool blankLineBeforePreMenu = true,
                            bool blankLineBeforeMenuHeader = true,
                            bool blankLineAfterMenuHeader = false,
                            bool alignCommands = true,
                            bool blankLineAfterMenu = false);

// Clean up after the parameter object returned by r4aTelnetContextCreate
// Inputs:
//   contextAddr: Buffer to containing the address of an R4A_TELNET_CONTEXT
//                data structure allocated by r4aTelnetContextCreate
void r4aTelnetContextDelete(void ** contextAddr);

// Process input from the telnet client
// Inputs:
//   contextData: Address of an R4A_TELNET_CONTEXT data structure allocated
//                by r4aTelnetContextCreate
//   client: Address of a NetworkClient object
// Outputs:
//   Returns true if the client is done (requests exit)
bool r4aTelnetContextProcessInput(void * contextData,
                                  NetworkClient * client);

//****************************************
// Telnet Server API
//****************************************

class R4A_TELNET_SERVER : public Print
{
  private:

    int _activeClients;
    R4A_TELNET_CLIENT ** _clients;
    R4A_TELNET_CONTEXT_CREATE _contextCreate;
    R4A_TELNET_CONTEXT_DELETE _contextDelete;
    IPAddress _ipAddress;
    const int _maxClients;
    uint16_t _port;
    R4A_TELNET_CLIENT_PROCESS_INPUT _processInput;
    NetworkServer * _server;

    // Close the client specified by index i
    // Inputs:
    //   i: Index into the _clients list
    void closeClient(uint16_t i);

    // Create a new telnet client
    void newClient();

