gene96817/R4A_ESP32/examples/Freenove_4WD_Car/R4A_Robot.h
  public:

    // Constructor: Create the telnet server object
    // Inputs:
    //   maxClients: Specify the maximum number of clients supported by
    //               the telnet server
    //   processInput: Address of a function to process input characters
    //   contextCreate: Address of a function to create the telnet context
    //   contextDelete: Address of a function to delete the telnet context
    R4A_TELNET_SERVER(uint16_t maxClients,
                      R4A_TELNET_CLIENT_PROCESS_INPUT processInput,
                      R4A_TELNET_CONTEXT_CREATE contextCreate = nullptr,
                      R4A_TELNET_CONTEXT_DELETE contextDelete = nullptr);

    // Destructor: Cleanup the things allocated in the constructor
    ~R4A_TELNET_SERVER();

    // Initialize the telnet server
    // Inputs:
    //   ipAddress: IP Address of the server
    //   port: The port on the server used for telnet client connections
    // Outputs:
    //   Returns true following successful server initialization and false
    //   upon failure.
    bool begin(IPAddress ipAddress, uint16_t port);

    // Restore state to just after constructor execution
    void end();

    // Determine if the telnet server has any clients
    // Outputs:
    //   Returns true if one or more clients are connected.
    bool hasClient();

    // Get the IP address
    IPAddress ipAddress(void);

    // List the clients
    // Inputs:
    //   display: Device used for output
    void listClients(Print * display = &Serial);

    // Get the port number
    uint16_t port();

    // Display the server information
    // Inputs:
    //   display: Device used for output
    void serverInfo(Print * display = &Serial);

    // Update the server state
    // Inputs:
    //   connected: True when the network is connected and false upon
    //              network failure
    void update(bool connected);

    // Write to all clients
    // Inputs:
    //   data: Data byte to write to the clients
    // Outputs:
    //   Returns the number of bytes written
    size_t write(uint8_t data);

    // Write to all clients
    // Inputs:
    //   data: Address of the data to write to the clients
    //   length: Number of data bytes to write
    // Outputs:
    //   Returns the number of bytes written
    size_t write(const uint8_t * data, size_t length);
};

//****************************************
// Time Zone API
//****************************************

extern int8_t r4aTimeZoneHours;
extern int8_t r4aTimeZoneMinutes;
extern int8_t r4aTimeZoneSeconds;

//****************************************
// Waypoints API
//****************************************

typedef struct _R4A_LAT_LONG_POINT
{
    double latitude;
    double longitude;
    double hpa;
    uint8_t siv;
} R4A_LAT_LONG_POINT;

typedef struct _R4A_LAT_LONG_POINT_PAIR
{
    R4A_LAT_LONG_POINT current;
    R4A_LAT_LONG_POINT previous;
} R4A_LAT_LONG_POINT_PAIR;

typedef struct _R4A_HEADING
{
    // Inputs
    R4A_LAT_LONG_POINT_PAIR * location;

    // Outputs
    R4A_LAT_LONG_POINT delta;

    char eastWest;
    int eastWestFeet;
    double eastWestInches;
    double eastWestInchesTotal;

    char northSouth;
    int northSouthFeet;
    double northSouthInches;
    double northSouthInchesTotal;

    int feet;
    double inches;
    double inchesTotal;
    double radians;
    double degrees;
} R4A_HEADING;

// Determine the central angle between two points on a sphere
// See https://en.wikipedia.org/wiki/Haversine_formula
// Inputs:
//   point: Address of an R4A_LAT_LONG_POINT_PAIR object
// Outputs:
//   Returns the central angle between the two points on the sphere
double r4aCentralAngle(R4A_LAT_LONG_POINT_PAIR * point);

// Compute the heading
// Inputs:
//   heading: Address of a R4A_HEADING object
void r4aComputeHeading(R4A_HEADING * heading);

// Display the heading
// Inputs:
//   heading: Address of a R4A_HEADING object
//   text: Zero terminated line of text to display
//   display: Address of a Print object to display the output
void r4aDisplayHeading(R4A_HEADING * heading,
                       const char * text,
                       Print * display = &Serial);

// Determine the ellipsoidal flattening
// See https://en.wikipedia.org/wiki/Flattening
// Inputs:
//   longRadius: The longer of the two radii of the ellipsoid
//   shortRadius: The shorter of the two radii of the ellipsoid
// Outputs:
//   Returns the flattening value
double r4aFlatening(double longRadius, double shortRadius);

// Determine the haversine distance between two points on a sphere
// See https://en.wikipedia.org/wiki/Haversine_formula
// Inputs:
//   radius: Radius of the sphere
//   point: Address of an R4A_LAT_LONG_POINT_PAIR object
// Outputs:
//   Returns the great circle distance between the two points on the sphere
double r4aHaversineDistance(double radius, R4A_LAT_LONG_POINT_PAIR * point);

// Determine the Lambert distance between two points on an ellipsoid
// See https://www.calculator.net/distance-calculator.html
// Inputs:
//   longRadius: Longer radius of the ellipsoid
//   shortRadius: Shorter radius of the ellipsoid
//   point: Address of an R4A_LAT_LONG_POINT_PAIR object
// Outputs:
//   Returns the distance between the two points on the ellipsoid.  Note
//   that the units of the large and small radii must match!
double r4aLambertDistance(double longRadius,
                          double shortRadius,
                          R4A_LAT_LONG_POINT_PAIR * point);

// Determine the haversine distance between two points on a earth
// See https://en.wikipedia.org/wiki/Haversine_formula
// Inputs:
//   radius: Radius of the sphere
//   point: Address of an R4A_LAT_LONG_POINT_PAIR object
// Outputs:
//   Returns the great circle distance between the two points on the earth
//   in kilometers
double r4aWaypointHaversineDistance(R4A_LAT_LONG_POINT_PAIR * point);

// Determine the Lambert distance between two points on a earth
// See https://www.calculator.net/distance-calculator.html
// Inputs:
//   point: Address of an R4A_LAT_LONG_POINT_PAIR object
// Outputs:
//   Returns the ellipsoidal distance between the two points on the earth
//   in kilometers
double r4aWaypointLambertDistance(R4A_LAT_LONG_POINT_PAIR * point);

// Determine if the waypoint was reached
// Inputs:
//   point: Address of R4A_LAT_LONG_POINT_PAIR object
// Outputs:
//   Returns true if the position is close enough to the waypoint
bool r4aWaypointReached(R4A_LAT_LONG_POINT_PAIR * point);

#endif  // __R4A_ROBOT_H__
